{"name": "Chai Pani", "address": "406 W Ponce De Leon Ave Decatur, GA 30030", "image_url": "https://s3-media3.fl.yelpcdn.com/bphoto/6kBdf3EKZ1BGCOnrO8yskg/o.jpg", "url": "https://www.yelp.com/biz/chai-pani-decatur-2?adjust_creative=KJ1vz5NsH8yJ2xFHQyys_Q&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_lookup&utm_source=KJ1vz5NsH8yJ2xFHQyys_Q", "phone": "(404) 378-4030", "alias": "chai-pani-decatur-2", "stars": 4.0, "reviews": [{"review": "One of Decatur's best gems. This is a great place to visit on a date night or with a small group of friends. Everything is served family style- similar to tapas restaurants. The food is stellar. We started with hot chai (free refills) and a few mango lassis. The lassi was thick, creamy, and authentic- it reminded me of travels to Dubai. I was a little surprised by the new menu but it did not disappoint. For our meal, we got the green tomato pakora, the daal special, chili chicken, butter chicken, and spdp. My favorites were: SPDP- It's a light wafer/crisp filled with cool creamy potato filling but it tasted like a fried deviled egg! So good and such a fun thing to eat. Tomatoes- Indian fried green tomato dish served with sweet yogurt and cilantro. BEST FRIED GREEN TOMATOES IVE EVER HAD. They're sliced thin so the batter really sticks well. when you bite it, you don't have to worry about all the breading falling off and the toppings set it over the top. Butter chicken- warm, comforting, standard Indian food done very very well. Seriously one of the best meals I've had all year.", "stars": 5.0}, {"review": "Chai Pani has been on my list to try.Wasn't quite sure what to order as it was a last minute decision and I was close to the area.  Rainy night 2/12/2021. Called in the order and it was fairly easy.   Got there the door area is blocked off for limited guest entrance (Covid).Thank goodness they had a tent to cover while you wait.    I ordered the Vegetable Korma.  I was a bit disappointed in the portion size.  It comes with rice, raita and desi slaw (red cabbage shredded).  It was an ok flavor,  nothing I must have again. I was not impressed with the desi slaw.  It didn't taste fresh = trash.  Raita was a little liquified than accustomed, but edible.   I will probably return to try the sliders and a couple other items.    Let's hope the next experience is better.", "stars": 3.0}, {"review": "My wife and I had a blast at this great little spot in Decatur.  I recommend getting there early and sharing a drink and some pani puri at the bar in the back.  Service was fantastic, and they made great recommendations.  My wife and I shared the mutton and the khamouri chicken with some basmati rice.  I would especially recommend that mutton.  This was a super fun and delicious spot.  Be sure to check it out!", "stars": 4.0}, {"review": "Was craving for some panni-puri, look no further than Chai-Pani. Amazing Street food, nice ambient. Parking can be a challenge here.", "stars": 5.0}, {"review": "We went to Chai Pani to try out the newest menu and it did not disappoint. I'm a huge fan of SDPD. You have to take it all in 1 bite for all the flavor and texture. My favorite main dish was the chili chicken. It's essentially sweet and sour chicken with more of a kick. The mutton basically melted in in my mouth. The prawn was delicious, big fan of the curry it came in. If you're a fan of shrimp I'd say take a shot. I was not much of a fan of the uttapam. For side dishes, I recommend the fried tomatoes. They're thin and crispy which is just the right amount of tomato for me.As for dessert, the gulab is basically moist donut holes. VERY sweet, and savory. The bhapa was my favorite though. It's a thicc, sweet, custard. Definitely recommend if you like custards/creme brûlée. All and all, we were very pleased by the new menu. Enjoy!", "stars": 5.0}, {"review": "Loved it. Enjoyed the atmosphere. We had the butter chicken, the Dahl of the day and the chili chicken. All were excellent. We had an order of naan, but the have a bread order in which you get a little of everything and I wish we had tried it. Enjoy!", "stars": 5.0}, {"review": "Love this place! Street food, sharing & good drinks! Christina was the best server ever, Taylor was also very kind to our table. I had the Butter Chicken & Corn Bhel, so delish! Will be back again. Mmmm So Good!!", "stars": 5.0}, {"review": "Excellent food, stellar service, and a great pick-up experience for COVID. My go-to is the sloppy jai, which is, as you may guess, an elevated sloppy joe. The lamb is seasoned well, the bread is absolutely fabulous, and the yogurt sauce...well I'd probably just drink it if I could. It's packaged very well for takeout, as the meat comes in a container so it doesn't get the bread soggy. Friends have reported that everything on the menu is also great; you probably can't go wrong anywhere.COVID pick-up is very easy--they have markers outside the door spaced 6 feet apart, and when you get to the door, they hand you your band under a plastic shield. It's never taken more than a minute or two, and the employees have been exceedingly friendly every time.", "stars": 5.0}, {"review": "I'm a loyal Chai Pani customer and have been coming to this establishment for 4 years. They reopened dining in and was excited to try it again after getting take out for so long! Much to my dismay their menu has complete changed where they got rid of a lot of staples such as chicken Pakoras, okra fries, sloppy Jai and chicken kathi roll. Worst of all I was charged $4.00 for basmati rice. Please bring the old menu back and reasonably priced dishes", "stars": 2.0}, {"review": "Stopped in for impromptu takeout this evening--had been here before but not since pandemic. The manager and host were kind to give suggestions and explained some of the dishes-- I inquired about possible dishes which may be lower in salt content due to salt restriction for spouse- Taylor gave me some dishes and also said he could let the chef know.I have eaten many Indian dishes so not a novice. The dishes were fresh, spices in perfect combination. I ordered the corn behl-- all the ingredients tasted fresh- corn, onions and cilantro- with a light mint-lime dressing on the side. The vegetable pav- also had a nice outer (not greasy) fried texture. potato mixture was delicious. A standard dish I try often is Bhindi masala-- the okra was not mushy bit with some texture and just the right combination of aromatic spices. I have had it elsewhere where the okra has been cooked to point where there is little texture and 'swimming' in oil-- this was not the case. Oh, and the Lassi has a nice hint of cardamom. A real bonus for me to observe was that they had  COVID-19 prevention strategies that were impeccable, and safe for dining at the eatery: everyone required to wear masks (all staff actually properly wore their masks, too); ventilation was optimal with large ceiling fans; nice spacious outdoor seating. They had a hand sanitizer station upon entering into the restaurant. I will be back for sure and I applaud the staff for their great service, excellent food, and attention to detail!", "stars": 5.0}, {"review": "I got this to go on Uber eats, it tasted absolutely amazing! I can't wait to try more items from here! The chicken Kathi, I think that's what it is called, tasted very juicy rich and unique. Highly recommend this place :)", "stars": 5.0}, {"review": "Man, I wish I'd tried this place more than a month before I'm slated to move to Texas. I used to have a more narrow palette so even though I loved (and still love) Botiwala, this menu intimidated me a bit.A week ago, though, my friend and I ordered food from here, and the corn bhel and and bhel puri were great. The star, though, was the samosa cholle chaat. It was all vegan (though you need to order the Chaat without yogurt sauce). It was so good that I ordered more last night for carry out, and I practically licked the container clean.", "stars": 5.0}, {"review": "One of the best places in decatur by far,Chai Pani is the place to go to experience great Indian Street Food. Whether you are new to indian cuisine or you are indian and can cook it pretty well at home, I recommend everyone to try this place out! First thing thats always an important pro to me in the atlanta area is that they have free self-parking! it is limited but you can find street parking easily too! The vibe in the restaurant is homey but hip at the same time! i love all the old bollywood film art. and that the food is served in steel plates it reminds me of eating food at home with my family. For drinks they have an ample amount of nonalcoholic and alcoholic drinks! My friend and I got the sangria and i think its my new favorite sangria! i loved the hints of cinnamon! Everything is on the food menu is so so yummy! I am in love with the kale pakoras think cripsy savory appetizer that makes a girl who hates kale love kale ( aka me) I also go the chicken kathi roll and it melted in my mouth! My friend got the samosa chaat and loved it as well! And the best part is its so reasonably priced! Last thing but our server was the absolute sweetest and so helpful for helping us decide what to get! I really recommend everyone to come try this place if youre craving indian or interested in trying something new!", "stars": 5.0}, {"review": "Excellent service during covid! Pick up and delivery only. Quick, clean, and fast service. The pav baji is so yum! Must go and try! Parking on the street available!", "stars": 5.0}, {"review": "I was unimpressed with everything. It had such good reviews, but everything tasted bland and was lacking in flavor. Will not be back unfortunately.TAKEOUT:$10 OKRA FRIES - These were pretty good! $14 VEGETABLE KORMA W/ NAAN - Zero flavor in my opinion. I asked for it SPICY and they gave me a side of chopped up jalapeños. Weird.", "stars": 2.0}, {"review": "I had high hopes based on the pictures and Yelp reviews. However I was disappointed with the flavor of the Dahi puri.Only the presentation was nice but food lacked flavor and authenticity was not there. The dahi puri was sour chutney, lacking that hint of sweetness. It needed more potatoes and lacked chickpeas. The bhel puri was a little better but it lacked chutneys. The crunch factor was there but dry.Kale pakoras were better. They were very crispy.Chicken kathi rolls (wrapped in parantha) with chutney were good but the chicken was not seasoned well. Nimbu pani disappointed me the most because that is the easiest thing to make. It lacked authenticity and freshness. There was a strong artificial taste coming from the syrup.We also tried the vegetarian thali and I can make better daal and vegetables.I really wanted to love this place but this is not the type offood I grew up eating in India and Pakistan.", "stars": 3.0}, {"review": "I've always really enjoyed the food here- spicy, tasty, crunchy, tons of variety- PLUSCOVID update: super smooth takeout experience. Ordered & paid online, and they had everything ready at our pickup time slot. Really appreciated: all the things that might have gotten soggy were portioned out for an \"at home\" assembly- so we got all the same delicious crunchiness out of the Bhel Puri as always. Really thoughtful, and a great eating experience.", "stars": 5.0}, {"review": "I should have ordered the corn behl. Where are the chick peas? The behl puri description on Chai Pani's menu via Postmates included chick peas. Used as a salad enhancer instead of a meal since it was basically fried seasonings with chutney and cabbage. We started ordering Indian food from Curry Up Now but chose take out from CP out of nostalgia. Don't look back is the lesson for today unless looking back means putting back ingredients in dishes instead of skimping on to-go orders.  The $2 naan looked sad, cold and thick like a bad batch of breakfast pancakes at dinner.", "stars": 3.0}, {"review": "This place is consistently a hit! The food is flavorful and well seasoned. I've had most everything there and they're all winners. My favorites are the paneer kati roll and the fish sliders.  Both have beautiful flavor blends. The Desi salad is a flavor bomb of deeelishusnuss!!!   Also, the staff are pretty friendly and accomodating.  Looking forward to the post shutdown relaunch.", "stars": 5.0}, {"review": "Kathi roll and mango lassi tasted great! The kale pakora and bhel puri were average. Definitely a cool concept / vibe.", "stars": 4.0}, {"review": "If I could give this place more stars, you can bet I would! I'm a sucker for Indian food, so I'm constantly on a hunt for good chaat and other Indian fusion food.I can safely say that my hunt is over because Chai Pani is hands-down the BEST chaat I have had in America. Even my Indian-born-and-raised mom approved...and thoroughly enjoyed the food!Firstly, the ambiance and restaurant decor lent a highly authentic vibe to the establishment, which looks like a refurbished garage. The bright colors and modern Bollywood music are sure to brighten anyone's mood! The staff are efficient, friendly, and were happy to help.Now, on to the food! We decided to order matchstick okra fries and bhel puri to share. The okra fries came with lemon and are a much healthier alternative to regular fries with an added crunch! More lemon and perhaps some salt would have been a good addition in hindsight. The bhel puri was truly amazing- it was the perfect blend of spices, chutneys, and onions. And everything was so fresh and not soggy! The portions are large and great for sharing.I ordered the mango lassi, and I'm glad I did. It was the perfect drink to wash down all the scrumptious food. This lassi was unique because it had a fair amount of cardamom, which I had not had before!For the entree, I ordered the chatpata paneer sandwich and was surprised at how simple yet delicious the dish was- the Maggi sauce was an interesting inclusion! Lastly, we ordered falooda because these are so hard to come by! It was spot-on, and my mom could not get enough!With all the food that we ordered, we had so much leftover: definitely not only got the bang for the buck, but also left feeling fulfilled and not stuffed. I LOVE Chai Pani, and wish I was in closer proximity to one in my daily life!", "stars": 5.0}, {"review": "Originally I was concerned we wouldn't be able to get a table for 8 on a Thursday night without a reservation, but since Decatur is technically outside of the city it wasn't an issue. I was thrown off initially as the dishes aren't what I've been conditioned to expect from an Indian restaurant and was presented with more of a small plates experience. As such I ended up ordering multiple pakoras... all of the pakoras, it felt like. Also all of the drinks. Turmeric Toddy was genius. Mango Lassi was perfect. Then there was bourbon and lots of water. Desserts, more food, great branding (tigers!) and more. Wish I'd taken more pictures because the several I have don't really do this place justice. If I lived in the area, I'd surely be a regular. And next time I'm in Atlanta, I will definitely return.", "stars": 5.0}, {"review": "This place is a must whenever you are in the Atlanta area. This is in Decatur which is such a cute neighborhood just 15 minutes outside of the city. There are at least a dozen good restaurants in Decatur and a phenomenal music venue called Eddie's Attic. I have been a fan of Chai Pani since it opened years ago and was completely shocked when I realized I had never written a review of this place. It is no question a five-star place! The atmosphere they have created with the decor and music takes you to a different world. There is a Pani Puri stand right there as you walk in so you can have a little taste of what is to come if you can't be seated immediately you don't have to be tortured with all the delicious smells coming from the kitchen. I have eaten so many things here that it will be hard to decide what to review, but I will go with the delectable items I have devoured many times. The dinner Thali with extra roti. It is a massive serving of basmati rice, daal, Saji, raita, hand-made roti, kachumber, Lijjat papadum, and Jamun. No, when I tried this dish for the first time I had no idea what most of this was, but it was recommended so we went for it.  I think of it as a bunch of dips and things that can be combined with rice or dip into with one of the \"bread.\" The samosa chaat is one of the most delicious things I have ever eaten. They are puffed flour round crisps that are stuffed with potatoes, onions, cilantro and crunchy chickpea noodles with yogurt and tamarind and green chutney. The Chatpatta Paneer sandwich is something you have to try even if you are not a vegetarian. It is a cheese sandwich with cucumber, onions, chaat masala served between two griddled buns. These are my three favorite things on the menu and I have a hard time eating anything else which is why I like to come with large groups so I can try more things.", "stars": 5.0}, {"review": "My sister took me here during my visit to Atlanta and it was definitely one of the best Indian restaurants I've been to! The dishes are more like tapas size so I would recommend getting a few things to share. We ended up ordering Chicken Kathi Roll, Fried Okra, and the Samosa Chaat. I thought the chicken kathi roll and the samosa chaat were both super unique and delicious because of the flavors. With the samosa, ours were still really crispy so the samosa chaat was not only flavorful but also had a lot of texture which I really enjoy.The only dish that I wouldn't order again would be the fried okra because I think it was over-fried. It was hard to taste the okra because they were fried to the point where they were more like chips and very thin and hollow, so it feels like I would eat a lot of it but still not be eating much. It was also fried too much or burnt so I tasted a lot of the bitterness.Other than that I had a great dining experience here and would definitely recommend this place. Can't wait to eat here again in the future!", "stars": 5.0}, {"review": "Roll into the restaurant...not one indian person in sight. Shoulda known what was coming....this is very \"americanized\" chaat. Go elsewhere for the real thing.", "stars": 3.0}, {"review": "Chai Pani has a great Indian Fusion ambiance. Growing up, I watched a lot of Bollywood movies and listed to tons of songs. Their Bollywood playlist here was nostalgic and brought back so many great memories. Right next to the entrance, they have a Pani Puri stand. To be fair, it's $4 for 5 puris which is a little pricy in my opinion and they're also way too watery for me. I prefer the Dahi Puri from their chaat section instead. As for food from the menu, we ordered the Chicken Thali, Sloppy Jai, and Kale Pakora. I was impressed! They were all very tasty and retained a lot of the authenticity of Indian food. I just wish it was a bit more spicier! I'm looking forward to visiting again and trying more of their Chaats!", "stars": 4.0}, {"review": "Great Indian Cuisine!  You know it's good, and probably authentic, when you see people from India actually going there to eat.", "stars": 5.0}, {"review": "First off I just want to start by saying CHAI PANI MAKES A DARN GOOD SWEET LASSI! Best I've had in town so far! And trust me, the search for a well made lassi is real. Theirs is the perfect thickness! Also, it's infused with rose water mmmm. Their iced chai also exceeds my expectations; this will be the most legit chai you ever sipped on on a hot summer day. My sis and I shared the bhel puri, corn bhel, and chicken pakora which was plenty enough to share. We even had leftovers. The bhel puri is a crunchy classic that carries an explosion of flavors in your mouth. It's LOUD. Not something I'd eat by myself though cause of how intense the spices are when built up in your mouth. Although it certainly compliments great when you eat it with another milder spiced starter such as the sweet crispy corn puri. Corn bhel was my fav, it's a refreshing mixture of cilantro, corn flakes, fresh roasted corn chunks, and tomatoes. The chicken pakoras were the perfect end as it filled us up. It's lightly battered, juicy, and the sauce is addictive!!  I'm obsessed with chai pani and want to try every thing else on the menu! It's light, exotic, and filling.", "stars": 5.0}, {"review": "Always a good time at Chai Pani!I always tell people don't expect super authentic Indian food, the flavor is all there, but a lot of the dishes have a spin on the Indian classic dishes. Needless to say my parents who are Indian and are supper picky love Chai Pani!!We went for lunch this time and it's fast casual as opposed to dinner which is full service. You order and pay at the counter and they bring the food to you. The food comes out super quick (we went at 1pm on a Wednesday). Faves are the:Corn bhelSPDPKale Pakoras& the veg Thali!!(Oh and the unlimited free refills on Chai :))The mango chaat and pav bhaji weren't on the menu this time but those are also other good dishes.", "stars": 4.0}, {"review": "The dish was pretty good. But a complete waste of ~$11... I'm not going to come back here. The size is super tiny. There was literally ONE potato in the veggie curry.... I'm vegan, maybe my expectations are too high.", "stars": 1.0}, {"review": "One of my favorite Indian \"Street Food\" Spots!Love getting several items and sharing them with the table. Some of my go to items include bhel puri, corn bhel, samosas, and paneer sandwich. The mango lassi is divine. They also have a pani puri setup sometimes which is always fun to eat.", "stars": 5.0}, {"review": "This was the coolest Indian restaurant I have ever been to! My husband and I were traveling to Atlanta for a day and decided to try this place for lunch after getting recommendations from friends. It has such a cultural vibe and the customer service is applaudable! The guy in the front was welcoming and took our order right away. Things that We loved/ recommend:Sev potato dahi puri Vada pav Falooda Fried okra fries The paneer sandwich was bit on the dry side and lacked proper sauces( could have used more sauce) so it was so-so. I hear the pain puri on the weekend is MUST TRY!!! But we went on a weekday so missed out of it. It is definitely an experience. I would 100% dream about the vada pavs and come back here again!", "stars": 4.0}, {"review": "First time coming here and the food was delicious! We ordered: Corn behl, kale pakora, Chicken Kathi Roll & kids cheese paratha. All employees have mask and gloves. You can not come inside the building.", "stars": 5.0}, {"review": "This place is really good. I had the lamb Sloppy Joe and it was excellent. My wife had the butter chicken with rice and it was really good, but not great. I'll be going back to try other things.", "stars": 4.0}, {"review": "I enjoyed the chai pani location in Asheville last month and honestly never stopped at the one here in ATL before my Asheville trip. I was craving butter chicken this week so my babe took me here. This location is bigger than the AVL one (seems more open and spacious). There are a lot of food options including some for vegans! There is also a nice bar if you're looking for drinks with your food. We shared the thali and some apps and were super full after. One of our appetizers was vegan and super delicious. The okra fries are the bomb here and just as tasty as the ones in Asheville. FYI there is no naan here - we eat these with our thali. I was told by our server they don't have a tandoor so no naan for anyone :( We would definitely come back here to get just appetizers as tapas. Although the tali here is legit too.", "stars": 5.0}, {"review": "How do you not love a place that greets you with a \"namaste y'all\"? This is a counter order, table service deal. After a minimal line (Friday during lunch hours) that moved quickly; we were enjoying a vibrant, polychromatic scene and the syncopated melodies of Indian musicians. The menu is somewhat of a contemporary fusion of Indian classics i.e. this is NOT your traditional Indian cuisine, which was unexpected but delightful. It's essentially all vegetarian except for ~two dishes (which is not uncommon for Indian fare) and we couldn't order them quickly enough. :) If you've been reluctant to try Indian food because of its 'hot as an Indian summer' (which is hot AF) reputation, or you're introducing someone to Indian food for the first time, this is a great place to start. You're experiencing traditional Indian flavors but without saying \"whew\" every five minutes as you wipe the tears from your eyes and snot from your nose, also known as the 'vindaloo experience'. I had the Sloppy Jai, which was absolutely delicious and perfectly prepared.  It's not hyperbole when they say it's \"the most awesome Sloppy Joe ever\", but I'll admit the competition was meager in this field. ~~~Not a fan of sloppy joes~~~ Service was adequate, atmosphere was lovely, food was delicious and price was nominal.  Strongly recommend if you're feeling a bit adventurous but not like, 'backpacking through India' adventurous.", "stars": 5.0}, {"review": "This is definitely the most written about Indian restaurant in Atlanta. I have even read it's mention in the magazines on airlines. The place opens for lunch and dinner. It closed at 3 in the afternoon and opens again at 530pm. I reached this place at 5.34 in the evening and there was a huge line to enter. So reach early if you are visiting this place on a weekend in the evening.Only on weekends there is a Pani puri counter at the entrance. You can eat it standing there or bring it at your table. They are spicy, tangy, full of spices. Payment of pani puris should be made outside at the counter. The staff is smiling, happy and efficient. The interiors of this place will definitely take you back to India.We ordered, 1.  SPDP (sev potato dahi puri) which is one of the most famous item on the menu. It had true flavors of Indian chaat. If you want to enjoy it the most, eat the whole puri in one go. 2. Chicken pakora - soft juicy chicken fried and seasoned with Indian spices. One of the my favorite dishes on the menu and highly recommended.3. Mango lassi - this is mango pulp and yoghurt  based drink which is flavored with cardamom. It was one of the best mango lassi I have had in USA. It was not too thick and artificially flavored.4. Chicken and paneer kathi roll - chicken and paneer rolled in a paratha (fried , flaky, tortilla). The chicken and paneer was soft, well seasoned and had a perfect blend of spices. Both kathi rolls were served with green chutney and sweet and spicy maggi ketchup. They are mostly known for their Indian street style food but they do have a separate menu if you are looking for curry based dishes.", "stars": 4.0}, {"review": "I've been wanting to visit Chai Pani for almost two years and finally got to do so over the weekend.  Really enjoyed a number of dishes as they offered a change from typical North Indian/Punjabi cuisine my restaurants feel compel to serve.  Particularly liked the Sloppy Jai (with Lamb Kheema) and the Chicken Kathi Roll.  The Chatpatta Paneer Sandwich sounded great in theory, but paneer is kind of a tricky ingredient to work with, and having two pieces per slider were a bit much: if there's a way to soften the paneer or maybe mix it with other ingredients to add more textural spectrum in there, that'd be nice.  The Chaat were less impressive: the Bhel Puri was fine (it was good to list all the different ingredients in it) but the Chicken Pakoras were pretty disappointing.  There were a lot of them, but they tasted a bit too much like chicken nuggets to me.The variety of dishes were impressive, but a little overwhelming.  Some more pictures online would really help, as upon reflection I might have dropped one of the chaat or the chicken pakoras for an uttapam.Follow @willchews", "stars": 4.0}, {"review": "Favorite Indian restaurant in Atlanta! I looove Chai Pani! It's not the typical I dian food, the food is great and unique. The restaurant has street Indian food. I have come to this place several times but this time I came here for lunch around 1pm on a Wednesday. It was not super busy. They have some specials for lunch which is nice.We ordered the mango lassis for drinks, which are really good! It's like a smoothie. We also got the samosa chaat as an apetizer (my favorite). It's 2 huge pieces and it comes with a chickpea curry. It's a good dish to share because it's pretty big. We also ordered the butter chicken thali, which comes with 2 sides, rice and roti bread. The butter chicken was sooo gooood!! And the amounts are pretty big. The other entree we got was the chicken kathi roll which was great too. I wish it had come with a small side (for example the fried okra). Another dish i like is the sloppy jai (lamb burgers) they are really good!Overall the food was excellent. The decor of the place is really nice and it's pretty spacious. I definitely recommend this place if you want to try something new and different!", "stars": 5.0}, {"review": "Visited while staying in Atlanta. Maybe  my boyfriend and I had high expectations because I knew the chef was  a 2018 James Beard semifinalist, but the food was just ok.  Just so ok, I wasn't willing to take leftovers (this almost never happens, if it's good I'll even take my other friends leftover to go!). We ate  till we were full but not stuffed.  We left feeling unsatisfied and said that once we we were back home in Tampa bay I would make  a trip immediately to eat at our favorite Indian mom n pop restaurant to now quell my craving for good Indian food. Our favorite thing we had and most unique was the matchsticks okra  fries (9 dollars) . Huge portion,  and every single one  crisp but not too crunchy. We loved these, but the more and more  we  ate  we felt like it was too salty to finish. I would recommend you try these  because where else would you get a chance to try okra fries?! If you don't like okra, because of the  taste and sliminess, I'm sure this would convert you instantly! Best way I've ever tried okra. For drinks I tried the safron margarita(10 dollars).  I love margaritas so I always am up to try a new  concoction  of a flavor. I know saffron  as a spice  alone has a very strong flavor to begin with and i didn't like it in the margarita. Better suited for food I'd say. I switched to non- alcoholic drink the Lime Rickey  (four dollars). I really liked this- refreshingly  delicious and not too sugary. It had raspberry syrup, lime, soda water.  Good base for a cocktail I thought. Tried the tomatoe and cheese uttapam (13 dollars). A uttapam is a thick savory pancake/ crepe made with rice and lentil batter with toppings cooked right inside the batter. This one had diced tomatoes, cheese, onion, cilantro, curry leaf, ginger, and chilies. Served with sambar and coconut chutney. This was my first time trying this and I just thought it tasted flavorless. Needed a lot of salt and although it had a lot of different spices it was so bland. There was no one spice you could definitely taste.  It was like they were muted like a small pinch used. I was expecting to taste cheesey onion flavor. I've had a Japanese  pancake before and that's what I thought it would be kinda like. Chicken tali dinner (17dollars) was not very good. The flavors just weren't soaked in. It tasted as if the meat could have used a few hours just slowly simmering or just sitting in the curry sauce. It was like the chicken was cooked then dropped in  precooked sauce and served  shortly after. Not horrible but not  good. Not enough chicken  in the portion to go with all those  sides.", "stars": 3.0}, {"review": "Indian food is making its way to the top of my list & Chai Pani just skyrocketed it. WOOOOW. Working with my friends on a Saturday and we got hungry. Two of them suggest Chai Pani and boy am I glad they did. I looked over the menu and landed on the chicken Kathi.. but I'll be back for that sloppy Jai. Now let's get into this roll it's so flavorful & topped with the sweet spicy ketchup it's a party in your mouth!! We called in the food they told us it would be 25 mins which is understandable for a Saturday  at 1:30 I'm sure they had a crowd. Walked in and couldn't help but notice the vibrant colors. I love it insideOur food was already at the counter. And the girl who checked us out was very nice.The quality of the food is impeccable and can we praise them for reasonable prices my food was 9.99. I'll be making more trips to downtown Decatur", "stars": 4.0}, {"review": "One of the crazy thing about this restaurant , take out means you order food and eat food inside and there is no one saying that !!Wish they could have made it clear, when there is another table where you would have normally expected someone to arrange a table for you This restaurant has a very homely touch , which means they make you work for the food , you have to get your water , get your silverware , not sure if I should run the dishwasher after we eat and mop the floors !!Mom would be proudAbove us for ambience and how to get your food , now for the food.Food is wonderful , we ordered a Bhel, thaali , Vada pav and much more Bhel was fantastic , the spices and the chutneys which were used were top class Thali : now comes to the disappointment part , thali in my definition should have multiple items , a dry subzi , a wet subzi , at least two items to mix with rice , thus was a sore point , you get a saag panner with lots of rice with Sambar , raitha , a roti and papadTaste was good but would have loved more dishes for the $ that's costing for the thali", "stars": 3.0}, {"review": "I'm gonna let the photo speak for itself because we got SO MANY things, that I don't even remember what all of it was. But it was all so good. So why only 4 stars? Honestly, because while my dish was good, I don't know if it was worth the price. I'd give it 4.5 if I could. A lot of things we ordered came out semi-randomly. But because we ordered at the cash register near the front, they came out MOSTLY in the order we placed our orders._ MIXED VEGETABLE UTTAPAM $12.99 (vegan) *gf - Carrot, peas, onion, cilantro, ginger, & chillies. Served with sambar & coconut chutney. The biggest reason I would say it's not worth the price is that there are other dishes on the menu that are cheaper than the uttapam, and either has way more food or even just protein, in general. I don't know if it's because it's a specialty item on the menu or what? Next time, I will get the grilled paneer salad, like I originally had planned. Or the samosa, which I got to try today!Otherwise, this place was really good. And they were able to seat all 7 of us without any issues. Thank you for putting up with our table, considering we were all standing around taking photos of the food and met there for a cookie exchange. A LOT of people got the sloppy jai, which apparently is a crowd pleaser. I didn't have any of that so I can't speak for it, but the people at my table said it was solid. _ KALE PAKORAS $8.99 (vegetarian) *gf - THIS IS SO GOOD. You would not assume it's kale when it first comes out. It was really cool looking and definitely a crowd pleaser. I really enjoyed this dish and think it's worth the price. _ MATCHSTICK OKRA FRIES $8.99 (vegan) *gf - one of their signature dishes, and i can see why. These okra fries are VERY addicting! Definitely try this if you go. Worth the cost 100%_ SAMOSA CHAAT $10.99 (vegetarian) - i regret not getting this. a friend got it, and let me have a bite. it was SO GOOD. probably one of my favorite things out of what everyone had. it just had so much flavor and surprisingly a LOT of food on the plate for being a samosa. if i were to come back, this is what i am definitely getting next time for myself.", "stars": 4.0}, {"review": "I can't visit Atlanta without grabbing a bite at Chai Pani! The Corn Bhal is so fresh and delicious! The Sev Potato Dahi Puri is chocked full of fresh ingredients that change with each bite! My 5 year old LOVES the Kale Pakoras and literally tries to drink the yogurt sauce right out of the cup! And the Sloppy Jai... SO. GOOD. I cannot recommend this place enough!", "stars": 5.0}, {"review": "Fun Place for Indian Street FoodChai Pani, or \"tea and water\", is slang for going out for a cup of tea, a tasty bite or a little something. This is a great place for a delicious twist on Indian street food. Our group of 9 had no problem getting a table around 6:30 PM on a Saturday night. Parking is a bit tight though. Ironic since Chai Pani is located in a renovated garage. Started off with chai tea lattes and mango lassis. The warm chai tea was perfect for a chilly October evening. The mango lassis were refreshing with yogurt and a hint of cardamon. For dinner, our favorites included the samosa chaat and the vegetarian Thali. The potato samosas served on a spicy garbanzo stew was so good. Loved the tamarind and green chutneys that dressed the dish. Thalis are such a great way to sample a variety of dishes. The vegetarian Thali featured kadhai paneer. Loved the traditional cheese in a creamy tomato curry with house roasted masala. Served with fragrant basmati rice, dal, roti, raita, kachumber, papadum, sambar and sooji halwa, it is easily enough for 2.  My daughter had the vada pav, potato dumplings, served on griddled buns (pav) which she enjoyed as well. Although we had no wait, and great service, there was a long line when we left close to 8 PM. Great choice for a Saturday night.", "stars": 5.0}, {"review": "Omg just had the sloppy jai and bengali fish slider. SO flavorful! A few outdoor tables but a bit too chilly to sit outside. DELISH!", "stars": 5.0}, {"review": "I love the lava veda and fried okra! I want to try other items but it's so hard when these are so good. The veda is a little spicy but not overly so. If anyone were to ask me I would definitely recommend this place.", "stars": 5.0}, {"review": "The Basics: Chai Pani is located in Decatur, Georgia. It features Indian street food in a sort of tapas-style (smaller dishes) and it is a sit down restaurant. They have extremely creative dishes here and the food is good. However, they are not going to have those typical Indian dishes you find in Indian restaurants in America, so if that's what you're looking for, this isn't the place for you! Things I like: The food was definitely creative and good here. These are dishes you can't get anywhere else in Atlanta (or many other cities in America for that matter). When I went we ordered the SPDP (Sev Potato Dahi Puri), the Samosa Chaat, and the Chicken Kathi Roll. The service was good and this meal was certainly memorable and I'm very glad I tried it. Things I didn't like: The food was definitely good, but I wasn't blown away by anything we got even though I was really excited to try Chai Pani. The portions were pretty small and I'm sure some of our non-enthusiasm with the food came with out ignorance in not understanding the culture of the dishes. For example, the SPDP was cold, which is how it is meant to be prepared, but just didn't fit my tastes. I also wish the atmosphere was a little better inside the restaurant. Also, keep in mind, Chai Pani shares a parking lot with Farm Burger and it can be really tough to find a parking spot.Overall, Chai Pani is a great place to try and makes for a memorable night out. I certainly want to go back and try to order other items!", "stars": 4.0}, {"review": "While evacuating Florida for a hurricane threatening to take out the entire state and living in Atlanta for a week, we discovered Decatur and this amazing place. Everything is good, but the absolute best thing, the dish without which you should not do, is the hot plate of salty, tart matchstick okra fries. They are unmissable. If I'm ever lucky enough to come back here, I will get these and eat them by myself and not share with anyone.", "stars": 5.0}, {"review": "Another successful dining experience courtesy of the Atlanta Dining Out Passbook (if you don't have one you should definitely look into getting one).Visited on a Monday during lunch time with my sister. While it is a sit down restaurant, you have to order your food in advance. After looking at the menu, I decided on sloppy jai and my sister got bhel puri. Also to try something new we got kale pakoras instead of our usually samosas. We paid, got our number, and although there were plenty of tables to choose from, we decided to sit at the bar. Almost immediately my sister's bhel puri came out. The drink menu does not consist of your usual drink concoctions and after discussion with the bartender, my sister settled on a tiger mule and I ordered the Jal Jerra Tequila. I really enjoyed my drink, and tastes nothing like the description. The remaining food came out while our drinks were being made. The sloppy jai wasn't very sloppy but it was delicious and flavorful. And those kale pokaras tasted better than I imagined they would. They were seasoned and fried nicely with a little kick to them.The staff was friendly and answered any questions we had. Def recommend this spot.", "stars": 5.0}, {"review": "First time trying Indian food and absolutely loved it. My favorite dish here was the Vada Pav, spicy potato dumpling fried in chickpea batter with green and tamarind chutneys.I tried the Bhakti Puri wasn't a fan not sure if it was that it's missing something or too much going on.I've never been a fan of Okra and this dish of Matchstick Okra Fries made me change so delicious. The only negative about this place was the service took forever to order, get a refill or even to pay. Also every tea I wanted to order they were out of.", "stars": 4.0}, {"review": "My husband and I had our dinner date here and we love it.. Liam, our waiter,was not Indian, but knowledgeable of the food we ordered and help us understand the Indian customs,like what food you eat with your hands and such, as we were first-time guests. The place was packed. I can't wait to go back.", "stars": 5.0}, {"review": "Man, for some street food, this place is rather expensive (approximately $30). But, people seem to love it. Even the to-go line was still a long wait compared to the dine-in area that was jam packed on weekend nights. But, there's hardly anyone during the lunch hours. The significant other ordered the matchstick okra fries, sloppy jai, and the chicken kathi roll. All were good, and I would rec all three. :)The matchstick okra fries: The julienned okra with salt and varies seasoning were delish! The portion size was great. Sloppy jai: The lamb with the sweet yogurt was so good. You basically compile the ingredients onto the two locally made pav (griddled) buns to make this Indian style sloppy Joe. Chicken kathi roll: The Joyce Farms tandoori chicken  was wrapped in a flaky paratha with Indian style ingredients. It had desi slaw, green chutney, an egg, and cilantro along with Maggi ketchup. It's still similar ish to Mediterranean style wraps but with a lot more seasoning and flavors.", "stars": 4.0}, {"review": "What a nice find! We came here on July 4th, seeing how it was one of a handful of restaurants open in the area. Despite having a special menu, they ran out of some items on it. Instead, we ordered stuff off the regular menu including the samosa chaat, sloppy jai, and lamb thali. WARNING- this is def not your traditional Indian joint; while the flavors pay homage to its roots, the plating and arrangements are novel and carry a more American twist. Quite lovely though! The samosa chaat was surprisingly refreshing and light, as it was dressed in a cold bean stew. Yum! Highly recommend. I wasn't too fond of the Sloppy Jai .. the lamb flavor was too musky and pungent, and it almost tasted borderline sour when served with the chutney/onion/cilantro herbs. I would prob avoid in the future. Our thali was excellent .. def the more traditional presentation, and it was prob the highlight of our meal, but it did cost a pretty penny.Overall, would I return? Sure! It does a great interpretation/presentation of Indian food, and felt very light on the stomach (I always have this exceptionally heavy feeling after eating Indian). Def recommend if you're in the area!", "stars": 4.0}, {"review": "I have eaten at Chai in Asheville and now Decatur; great places both. Again, the Sloppy Jai was my go to. We also had Chicken Pakoras; Indian version of buffalo wings. The Gulab Jamun is a treat; get some. We will definitely be back to try other menu delights.", "stars": 5.0}, {"review": "Yeah so, although there is a fine line between each star rating, it's just too easy to rate Chai Pani a SOLID FIVE when you walk in to this vivid, inviting and delectably-scented place. My cousin knew exactly what she wanted and I was happy to go right along with her suggestions. ANY of the CHAAT /Puri's are to - die - for, because they are light bites of crispy, herbaceous, creamy, cool and savory with a hint of sweet, I mean talk about everything you WANT in a bite of food to stimulate your palate! We also shared a lunch 'THALI' platter with basmati rice, butter chicken, roti bread and crispy, peppery papadum and as I sit here recounting every memorable bite I remember exactly why the scent of Indian curry was my very first in LIFE and why it's absolutely one of my favorite cuisines.  We ALSO shared crunchy Bengali fried fish sliders with 'kachumber' which I imagine is their updated version of a slaw and we had lots of leftovers that the babies enjoyed for dinner. I cannot wait to come back here and I have got to start making more Indian food at home. Uhmazing.", "stars": 5.0}, {"review": "The okra fries are like crack. Please start with those. The cocktails are also inventive and tasty. Besides that, nearly everything on the menu is made with flavor and attention to detail. I'd say the only downside is the long wait you may get stuck in if you try to visit on a weekend night, but even then they offer little snacks in the waiting area.", "stars": 5.0}, {"review": "Yet another wonderful lunch at Chai Pani. They are so consistent with the preparations. Love this place and I keep visiting whenever in Atlanta. This time we ordered the lunch thali , sev Puri dahi Puri, Gobi Manchurian ,faluda and our all time favorite wada pav. I am all praises for the wada pav- this is the more closest with the local Indian wada pav food stalls , a must try! Keep it up..", "stars": 5.0}, {"review": "to all  the Pani Puri/golgappe lovers , this is one of the best places in USA serving the perfect Pani Puri. Kudos to the team! One more wonderful dish is the vada pav a must try when here. love the food , awesome chat and thali options available. Whenever in Atlanta will definitely visit without fail. Highly recommended!!!", "stars": 4.0}, {"review": "We have been here several times.   The food is good, and sometimes it is Outstanding...!   Lack of consistency is the issue, but it's never below good, so we will continue to eat here.Now, service lacks.   Sometimes you get a good server, and sometimes you get one that is not so good.  Both locations are Four Stars all day!!!", "stars": 4.0}, {"review": "I do not know if I got their regular service or not. I hope not. The food was good, but the portions were smaller than a child's meal. I had ordered two dishes, Samosas, and a main dish. They both came on a small plate, one samosa, and a very small bowl of soup. And this was still priced as for a regular meal that would fill me up. I left still VERY hungry and dissatisfied. I did go to another restaurant that had more in their appetizer than Chai Pani had in two dishes. I will never go back. Too much for far too little.", "stars": 1.0}, {"review": "This place is perfect for grabbing a bite with friends or even date night. Atmosphere is warm and cozy. I have tried a variety- doi puri, bhel puri, okra fries and thali. Also mango lassi. Everything is absolutely delicious and so fresh. Downside: Pricing is a bit high for the portion you get.", "stars": 5.0}, {"review": "I love Indian food. This place confuses me. I haven't been to India so I thought, maybe this is legit Indian food and what I'm used to isn't? But then taking a look around the restaurant and not seeing a single Indian or even relatively South Asian looking person on staff or eating there probably should answer my question. The Indian movie posters and bathroom signs in English and Hindi seemed pretty... disingenuous? I got the sloppy Jai for lunch and it was small for the price. Was good but also seemed easy to make at home, just make sloppy joes with Indian spices and red onions.Staff were friendly and service was quick.", "stars": 3.0}, {"review": "Chai Pani Decatur is an Indian street food place where you get snacks, platters, lassis and draft beers in a casual, colorful space with a hip vibe. Chai Pani can also mean a small bribe just enough to get a bite to eat. Decatur is well known for its amazing Indian food and Chai Pani is arguably the best of the bunch. Indian small plates similar to Tapas, really fun and plenty of veggie options. Literally everything I've had at Chai Pani has been fantastic and yummy. This place is one of my favorite Indian Restaurants.\"Indian street food becomes art\" at this \"hip\" spot in Decatur from husband-and-wife team Meherwan and Molly Irani, who've brought the \"approachable\", \"finger-lickin'\" cooking from their Asheville, NC, location to life in the former Watershed space; although some say it can get \"loud\" in the \"exotic\" setting, \"reasonable\" prices and \"friendly\" service compensate. Contemporary Indian street food - chat corner. I recommend this place. Pricey though. Be prepared to wait for long before be seated. Tastes and environment would make the wait time worth.I will recommend the Veg Thali/Non-Veg Thali for people wanting to venture in and try a few different things. Also points for refillable yummy chai. And the Pani puri is amazing. A great place if you're trying Indian food for the first time. The best thing to eat here is Bombay Style Vada Pav and other snacks. It is a theme restaurant based on all Indian signage and phrases all over the walls and around. I love it's ambiance. While it has outdoor dining area too. On a sunny day eating out here and enjoying the weather is the best thing to do.It is a must visit.", "stars": 4.0}, {"review": "Talk about yummy Indian street food - Chai Pani is where it's at! I am biased since I love Indian food, but the quality and taste here is like no other. I love ordering their thali meals which comes with a daily special entree (I usually opt for the meat option, but their is a vegetarian option as well). Their drink menu is diverse as they serve some of their own cocktail concoctions. They are also allergy friendly - those who are gluten feee can order their uttapam and chicken pakoras dish as well as many other choices. Hands down one of the best Indian places in Atlanta! Fun fact - They were also recently featured on the Netflix show Queer Eye as a restaurant suggestion from the food expert Antoni Porowski.", "stars": 5.0}, {"review": "Chai Pani is one of my new favorite Indian Restaurants in the Decatur area! The servers were very attentive and gave some delicious recommendations. The first dish I was able to enjoy was the Sweet Potato Ragda. The roasted sweet potato and pomegranate in the dish made for a tasty combination. The next dish I had was the Bengali Fish Fry Sandwich, which was truly delicious, especially it being topped with ginger-chili mayo. If you get a chance try to visit them on the weekend, they serve a great Pani Puri at their \"Pani Puri Counter\" between 5:30 PM to Close.", "stars": 5.0}, {"review": "We are very selective about our Indian food (we have a favorite at home that wins out every time), but we enjoyed our meal here.  We had the Samosa chaat, which is savory, spicy cumin scented potatoes served in a flaky pastry with a garbanzo bean stew.  Then we had the Thali specials, the chicken and vegetarian.  Unlike many Indian restaurants we've been to (minus Chauhan's Ale & Masala House in Nashville) this one has an inventive cocktails menu.  The saffron margarita is decadent.  The Pani was my favorite, with a strong cilantro flavor.  They also have punch specials.  Worth a trek out to Decatur for this unique, flavorful meal.", "stars": 5.0}, {"review": "I stopped by Chai Pani for dinner before a concert and ordered the SPDP off Yelpers' recommendation. They were super delicious but I was still hungry so looked at the menu for round two. Decided to try the Sloppy Jai as well and was very impressed! Both dishes had excellent flavor, a great mix of textures, and weren't too expensive. Can't wait to return next time I'm in town", "stars": 5.0}, {"review": "Food - The sloppy jai lunch and the chicken kathi roll was perfect! But you have to combine everything that you are given. It brings it all together so well. For the sloppy jai the lime and yogurt cuts the richness of the chutney and the \"game-iness\" of the lamb. And the chicken roll with the spicy yet sweet maggi ketchup. It's perfectly light enough to account for a midday lunch. Just enough to hit that spot.Service - Basically you pay for your food, get your food brought to you, you finish and then you simply leave. No formalities or traditional procedures. Just enjoy your food and go about your day. Very nice and pleasant.", "stars": 5.0}, {"review": "I'm very impressed! Loved the Bhel Puri and Falooda. A must visit place if you're around Atlanta.Has a nice, unique ambience too.", "stars": 5.0}, {"review": "Seeking out an approachable, family friendly Indian restaurant in the Atlanta area? Look no further! Chai Pani is about as delish and fun as it gets.The restaurant shares the former Watershed space with a dry cleaners and Farm Burger. There's a small patio space (maybe five tables), a decently-sized lobby with a puri-making station, and a very large interior dining room. The ambiance is upbeat, with lots of bright colors, lively music, and a young bustling staff. If you come during the busiest hours and have to wait....well lucky you! You get to purchase puris (they call them SPDPs) from the little puri-making stand as they're ready. The menu is a lot more interesting than just the Americanized tikka and butter chicken dishes. I'm talking Sloppy Jais and Bombay Chili Cheese Fries, and an ever-changing daily special that can be anything from lamb burgers to grilled swordfish. I've not been to any other Indian restaurant in ATL with such a creative and playful menu. Favorites:- SPDP (sev potato dahi puri): bite-size crispy puffs filled with potatoes, onion, cilantro, and crunchy noodles with sweet sauces on top. Served cold, they're meant to be eaten in one big bite - or else you risk those sauces pouring all down your front!- Samosa Chaat: deconstructed vegetarian samosas on top of garbanzo been stew- Sloppy Jai (Kheema Pav): think Sloppy Joe's but with ground lamb instead of beef and a strong spice belnd (not spicy, but flavorful)Oh! I'd be remiss if I didn't mention the FABULOUS cocktail menu. I definitely recommend the spicy iced chai. Definitely one of Atlanta's best!", "stars": 4.0}, {"review": "This was a tale of two experiences - good service, and the food we ate was very good, but there was some difficulty getting to that point.We had picked out this place because the menu options looked good, and they had plenty of gluten-free options on the menu. When we started asking about different items on the menu, though, to his credit, our server was careful enough to check on any risk of cross-contamination. The items marked gluten-free don't have gluten as ingredients, but could have cross-contamination from using the same cooking surfaces.Our server was great about finding out details from the kitchen to make sure we could enjoy our meal, but it turned out that we really only had one option to be truly gluten-free. We decided to get that, but when it first came, there were items on it that have gluten, so that had to get taken away and replaced. All in all, it took us quite a long time to finally get our meal. Halfway through, we ordered another one so it could get started while we finished the first order.The food we got tasted good, and our server was very patient and helpful, but it was a little disappointing that there weren't many truly gluten-free options. I do appreciate the kitchen's knowledge about everything, though.Ambiance is nice, and prices are pretty reasonable.", "stars": 4.0}, {"review": "I went here on a Wednesday evening with friends and absolutely loved it.  We walked in and were immediately seated.  It took too long for our server to come see us, initially, particularly since I had to go tell the hostess that no one had come to our table yet after about 10 minutes of waiting.  We ended up sharing many plates and all were delicious.  We had the samosas, corn bhel, chatpatta paneer sandwich, matchstick okra fries, tandori chicken and bhel puri.  Everything was so delicious that I cannot wait to come back and check out more items.  The prices were reasonable, as well.  I would have rated this place with 5 stars if the service had been better.  It took awhile for our server to make it to the table and then at the end we didn't see them for quite awhile, again.  This is a great place for people of all ages and can accommodate parties of all sizes.", "stars": 4.0}, {"review": "Chai Pani is a popular Indian staple in the area. Watch for their specials, a lot of good entrees on the rotation. We have been here multiple times, with a good variety of dishes. Cocktails are also great here and have an Indian touch to them. Thalis are not as amazing as I would have hoped, but other items on the menu are delicious.Overall Chai Pani is great for an Indian fusion restaurant. Other places town might be better suited for true authentic Indian food.", "stars": 4.0}, {"review": "Really Yummy! I ate too much because the menu was so intriguing. I licked the platter of my Fresh cabbage salad with fried cashews. For downtown Decatur it was a surprise to find parking available. Service was excellent. I will return.", "stars": 5.0}, {"review": "Chai Pani is great! I ordered a bunch of stuff. My favorite was the fried okra- AMAZING. I could eat it every day. The only thing I didn't love was the naan- tasted more like pita bread than traditional Naan.", "stars": 5.0}, {"review": "The BEST!!! I used to work here part time for just a few months and I learned a lot about the incredible food here! Everything I have ever tried coming out of that kitchen and bar is top quality incredible flavor! I can speak personally for the cleanliness of the kitchen, bathrooms, and restaurant! This restaurant is run like a well oiled machine, they know exactly what they are doing and do it  very well!I have not had one single meal that did not completely blow me away! Be adventurous here, it's like an explosion of flavor and party on your tastebuds!The chai is also very good, beware Americans the salt lassi is not for you! Drink the mango lassi instead!", "stars": 5.0}, {"review": "Awesome food! Great drinks! Rickshaw Romeo is the best drink ever!!! It would be nice to have more descriptions on the menu and not have to ask the server to describe everything. Other than that great food and service", "stars": 4.0}, {"review": "Joey and the team are amazing. Incredible service. Food is fantastic. Love this place!", "stars": 5.0}, {"review": "Chai Pani adds a spin to Indian style street food. I really enjoyed the chicken pakoras! I shared this as an appetizer and it was perfect amount for two people. The chicken was nicely flavored with a slight kick of spice but definitely not overly spicy. For my main meal I tried the Sloppy Jai because I love lamb and was very pleased with my choice. My favorite choice of the night was the Gulab Jamun! It was sooo delicious! The treats are warm & the texture is really soft - almost cream like when you take a bite. It's also pretty sweet, which makes a great dessert choice.", "stars": 5.0}, {"review": "Always worth the drive. Perfect COVID to go experience. They wear and require masks and the food never disappoints. Just wish they had the potatoes you can get at their sister restaurant.", "stars": 5.0}, {"review": "Let me preface this review by stating that the food at Chai Pani is the truth. My girlfriend and I have very picky tastes when it comes to Indian food and Chai Pani delivers. The chaats have the authentic flavors we crave routinely and the more fusion-y items respect the roots of Indian cooking. Classics like the sweet-spicy-sour bomb of the crispy SPDP, nutty and crunchy kale pakoras, the soulful Sloppy Jai kheema pav, and the addictive chicken kathi roll have all satisfied on the cheap and truly taste memorable. That being said, The service is. so. bad. We have been to this location twice with medium-large (6-9 people) groups and have had fairly bad service both times. I chalked our first experience up to bad luck, but our last visit delivered egregiously bad service. Our cocktails did not arrive until well into the main course (and one was totally forgotten). Our server appeared to ignore us. Food tickets were lost and no apologies were made when this happened. Both experiences occurred on weeknights when the restaurant doesn't swell to capacity as it does on more popular evenings. Maybe the kitchen and staff just suck with large groups, or perhaps the restaurant can't handle the extra popularity from Queer Eye. Regardless, Chai Pani earns its keep on food and food alone. The ambiance is nice and the menu is killer, but it will be difficult to return for anything but take out", "stars": 2.0}, {"review": "If you're in the mood for Indian food from a super diverse menu this is the place to go. They specialize in street food fare ;, but it's easy to get full with ordering two apps and one thalia to share between two people. Courteous staff and you can join the waitlist ahead of time on yelp app. We tried the lamb Thalia , the okra fries, and the samosa chat.", "stars": 5.0}, {"review": "This place was so good!! It's order at the counter and was extremely quick. The flavor was really good - perfect amount of kick. Really cool vibe and beer selection. I've never had Indian street food befor but really liked it!!", "stars": 5.0}, {"review": "I've been a devotee to the delicious offerings at Chai Pani Decatur for years now and am finally getting around to writing a review based on my last visit a few weekends ago.Parking: very limited parking around the small building--sharing what is available with FarmBurger next door. You may have to drive around the perimeter a few times to wait on a spot or possibly do on-street parking farther out and walk over.Atmosphere: the space is a converted garage, so it has an industrial chic mixing metal and wood with vibrant colors and playful decor like old Bollywood film posters. It is a generally lively space since it is almost always busy. You enter into a long foyer where you can check in for a table, order take out, and even grab a sample of puris (puffed crisps) while you wait. Space is fairly large so could accommodate a range of sized groups.Food & Drink: the food is always fantastic and the main reason I come, but the drink options and cocktails aren't bad either! Chai Pani has a full bar and keeps a decent, albeit small, list of solid craft beers on tap. You can certainly enjoy eating here solo, but I'm a fan of bringing a small group and then sharing a number of dishes and the chaats (Indian street food served as small plates). This is always a fun way to try a lot of different flavors and figure out of which you might want more. If sharing isn't really your thing, the thalis (platters) are also pretty good and very filling for one person. On my most recent visit, we ordered the:+ Mango Lassi ($4.50) - yogurt drink; really good, had additional spices that I don't usually taste in other mango lassi + Kale Pakoras ($9) - I'm a big fan of these, like more robust kale chips, but some in my group were instead bigger fans of the...+ Matchstick Okra Fries ($8) - kind of reminds me of shoestring french fries, a great shareable snack, everyone enjoyed them+ Samosa Chaat ($11) - really can't go wrong with an order of samosas+ Sev Potato Dahi Puri (SPDP, $8) - these were recommended by the waitress and were really fabulous, great layers of flavor+ Green Mango Chaat ($10) - another table favorite because its flavors were so fresh and a nice contrast to the fried items+ Sloppy Jai (Kheema Pav, $11) - good but was surprisingly not a favorite + Non-Vegetarian Thali (varies) - unlike the other dishes, this is a full meal by itself, but we shared it amongst the group; it's served with basmati rice, daal, sabji, raita, roti, kachumber, papadum, and dessert + Sooji Halwa ($4) - dessert made of a semolina flour pudding, golden raisins, cashews, cardamom, and pistachios Overall, another solid experience at Chai Pani  Food, service, and atmosphere was great. Would definitely recommend!", "stars": 5.0}, {"review": "Over the last week, I have given out a fair number of 5 star reviews. It's challenging sometimes because for some restaurants they fit perfectly between a 4 and 5 star. How do you approach that? Round up or down?We were invited out to dinner by friends who frequent Chai Pani so we had to give it a try. This was our first Indian food experience in Atlanta. Interestingly, this is also the first place where I have had the chance to try \"street food.\" Most other restaurants you have your usual curries and such but coming to Chai Pani is something quite different. The menu is shorter than most other Indian restaurants (the first good sign that the food is made fresh!). Many of the food on the menu I was not familiar with but luckily they came with a description. This is the second location of this restaurant (the first being in North Carolina). For an appetizer (or Chaat) we had the matchstick okra fries and the chilli chicken. The okra fries were awesome cut very thinly then fried. They were crunchy and still maintained the okra flavor. Cooking with okra can be challenging because if done wrong, they get slimy. The chilli chicken was delicious with savory pieces of chicken nuggets that were fried and then served on a side of ginger chilli sauce. How do they keep the chicken so moist? The world may never know...For entrees, we went with the uttapam which are sort of like a savory crepe or a savory pancake with vegetables baked into it. You can get a mixed vegetable that is vegan or a tomato and cheese one that is vegetarian. We went ahead and got a mixed vegetable uttapam which came with two dinner plate sized crepes that is enough to share. Delicious! Really surprised by how savory this dish was. We also went with a curry special: the butter chicken. It was sweeter than other butter chickens I have had before but also a really delicious dish. I was a little disappointed by the service we got yesterday because it took a while for us to get our order in and then it took a while for us to get the bill... and then to pay. Yes they were busy but surprising though that this was a challenge for them. Other than the waiting, this was a fantastic 5 star experience. I'll give them the benefit of the doubt that this was a one time occurrence as I'm eager to come back and give it another go!", "stars": 5.0}, {"review": "The food is great but the price is ridiculous. This is STREET food, street food shouldn't cost 10$+ per dish. If you want the same food but truly authentic and not a gentrified version go to the Patel Plaza and eat at Chatpatti or Honest. You'll be paying for quality food and a STREET price!Samosa chat @Chai Pani $10.99 @ Chatpatti $6.99Thali @Chai Pani $12.99+ @Honest $10.99 plus more stuff", "stars": 4.0}, {"review": "Pretty average spot for how much money you're paying. Our bill for four people came out to be $80 (which is insane, considering we didn't even have any leftovers).Service was good, nothing to complain about or rave about. The food was good. It was pretty standard Indian food with a twist. Caution; the food is pretty spicy, especially for \"american-ized\" Indian food! Everything I tried was pretty good. I had the sloppy Jai and tried my brother's chicken burger. They were seasoned properly, but didn't seem healthy.One complaint- the food was oily as heck. You'd think that by paying more for what is essentially \"street food\", that you'd be getting better quality. I wouldn't come here on a diet, for sure.Coming here is worth a shot. Keep in mind that you're paying for the aesthetic of both the location and of your meal. You're not paying for the amount of food, or necessarily the quality.", "stars": 3.0}, {"review": "This place is delicious! Everything we got on the menu was amazing. I especially loved the okra fries- tasted light despite being fried. We had a gluten free person in our group and they were super accommodating!", "stars": 5.0}, {"review": "The Vada-Pav at this casual and vibrant joint is to die for.  It's one of the 2 best I have had in the US (other being at Houston, though I am from NJ).Pani Puri is very flavorful and served the right (and only way) to serve Pani Puri.Did not enjoy the cocktails that much but will definitively be back for the food. 4", "stars": 4.0}, {"review": "This restaurants get my rare 5 star rating. This is by same owner that has a restaurant in Asheville NC which we missed when visited. I love the $4, 5 piece gol gappa counter. I loved the ambience, Namaste y'all very nice message on waiters t-shirt. The pav bhaji was the best in USA. I almost felt comfortable asking for extra pav that is common in Mumbai Pav Bhaji stalls. My daughter loved the nimbu pani. I missed trying jaljeera cocktail, since i thought indian restaurants aren't known for cocktails, but upon reading further reviews, I felt I should tried it. We'll visit next time and try that. The uttapam was nice and freshly made. The sev puri was good too. There is a good interview on NPR the owner has. People interested in the history should google it and listen to it (it was on WUNC.", "stars": 5.0}, {"review": "The corn behl is like hitting the refresh button !!!Had dinner with friends. Menu is perfect, something for everyone. Service was awesome and chef was very accommodating. Will be back definitely!Excellent eating experience.. from walking in the door and being greeted by employees , seated and drink order taken, was maybe 5 minutes. Meal was served hot and excellent taste. Server was very friendly and helpful.", "stars": 5.0}, {"review": "If you are expecting a lot of indian street varieties this is not the place for you.They have very limited street food options to select from (they dont serve pani puri either which is the most consumed street eat). They serve few street eats and thali (check out the menu picture i posted).The prices seem to be very high and the service isnt that great. The food we ordered was OK nothing great about it. The keema pav had a weird smell of the meat.I would suggest Masti for indian street eats anytime.", "stars": 3.0}, {"review": "Came to \"Chai Pani\" after many friends telling me that this one of the best Indian restaurants in Atlanta. Honestly, the ambiance is nice (different than traditional restaurant) but food, not impressed at all. I ordered Veg Thali (paneer do pyaz was main item) and the paneer was bland without flavor. Paneer has no taste and the sauce was tangy and it's like both are cooked separately and mixed just before bringing to table. Rice was too much and had some odd smell. Overall thali was a huge disappointment. I ate much better paneer do pyaz else where. On flip side, nimbu pani was good and had good flavor. I would not recommend \"Chai Pani\" for regular restaurant food. I have not tried street food here. So cannot comment on that.", "stars": 2.0}, {"review": "Innovation.It's what excites us. I don't know about you, but I kind of get tired of eating burgers and sandwiches all the time.Chai Pani is one of those places where nearly the entire menu is innovative and makes you wanna try a little bit of everything - which you kinda can! The Chaat portion of the menu is composed of  a variety of shareable finger food dishes, similar to Spanish tapas, except the portions are WAY more generous. I made the mistake of getting both the Kale and Chicken Pakoras by myself (by the way, you can get half-orders as well, which is not mentioned on the menu) and this shit was enough to feed a family. The kale was battered and deep fried, and went perfectly with the yogurt sauce. The chicken was all white meat and I liked it better with the green chutney. Both dishes are probably enough to feed 3 or 4. I also had an order of the SPDP (I'm too un-Indian to remember the full name) which was a refreshing, unique appetizer as well.On top of that, they have a full bar with a bunch of Indian themed cocktails, which looked pretty cool. And they're probably the only spot in this neighborhood serving a good cup of chai ($2.99, including unlimited refills), which is perfect for these winter days. The only gripe I have - I would prefer more spice in the food. I don't want the food toned down for my Americanized, burger-eatin' palate. But that's just personal preference.", "stars": 5.0}, {"review": "One of our favorite Indian restaurants in the country. The staff is exceptional along with the delicious food.  The consistent food comes out quick, hot, and extremely tasteful. Highly recommend!", "stars": 5.0}, {"review": "Always a great time, but I have to remember that most things are spicy to me lol. The fried chickpea shot things (Pani Puri?) are yummy though a little odd, definitely an experience. Great cocktails, like the gin cucumber one they had tonight, but ran out of. Get the fried chicken and kale appetizers, super yum! There will be a wait so prepare!", "stars": 5.0}, {"review": "Chai Pani is a favorite Indian street food spot. It's the best when we walk in and they are serving up some panipuri to eat up before grabbing a table. For those unfamiliar, panipuri consists of a hollow crisp \"puri\" (made out of some kind of thin fried dough) filled with flavored \"pani\" (water) consisting of spices, chutneys, potatoes, and a bunch of other stuff I'm not sure about but that taste delicious. You put the entire thing in your mouth and savor.In terms of main dishes, you can't really go wrong but some favorites of mine are the chilli chicken, vada pav, sloppy jai, and chicken kathi roll. I have also tried one cocktail there which was amazing -- the Shahrukh n' Stormy. Coconut cream, lime, ginger, and rum. SO good. This place serves up authentic and delicious Indian food - a must try!", "stars": 5.0}, {"review": "This was my second visit to the Georgia outpost of this restaurant, the original being located in Asheville, NC.  The food is superb.  However, on a Sunday when the place opens at 1130 a.m., you better be there or you are going to stand in line.   There ae no reservations.I ordered the Sloppy Jailai, lamb sliders with dressings.  It was outstanding.  My wife had the equally tasty Saag Paneer.  We shared a plate of fried Okra, which is one of Chai Pani's signature dishes.  We drank masala chai.Our only disappointment was the inability to order halwa, which was listed on the dessert menu.  The front receptionist told us they don't start serving it on Sunday until 1:30.  (???)  A waitress at first said she could get it for us anyhow, but then the wait service manager told they were \"out\" of the ingredients. (???) Go figure. Any way, we tried two alternative desserts, both of which were good.  The first, bajapai, was a custardy delight with embedded golden raisins.  It had the consistency of baked condensed milk and was excellent.  The second was a house special, fallooda, with rosemary sauce.  We both love rosemary, but it is certainly a distinctive and non-Western flavor which may take some getting used to.  It's worth the experiment, if you have not ventured that way.", "stars": 4.0}, {"review": "This restaurant is a companion to the smaller version located in Asheville, NC, which I have also reviewed.  This location is bigger and somewhat noisier, but the food is still outstanding.  On a recent four day weekend in the Roswell area, my wife and I ate here twice.  The first occasion was a Friday night; the second, for Sunday brunch.  Lynn, my wife favors paneer (cheese) dishes, which she ordered on both occasions,, once with sag (spinach and once with palak (spinach/tomato combo).  I selected the lamb burgers on both visits, once as a thali (part of a dish with vegetables and soups) and once as a main course.  We also had the fried okra on Sunday, which is simply as good as it gets for an appetizer.  We also had assorted condiments--tamarind sauce, achar (sour sauce composed of mango, lemon or pickle), coriander/mint, and raita (yogurt)..   Servings come with rice and bread (we opt for roti--which is whole wheat).  The food is really excellent.  Lynn selected a halwa (wheat pastry) for dessert, while I just had two glasses of wine.  She also enjoyed their excellent masala chai (tea).  On Sunday,.just for variety, after our meal, we drove a few miles to Royal Sweets on Church Street for a special treat:  barfi--a box of home made Indian sweets.    There is parking in the lot where the restaurant is located.  The place can be busy at dinner time.  The service was excellent, if beleaguered on a Friday night.  The front greeter on Sunday seemed a little aloof, but the table server was first rate.", "stars": 5.0}, {"review": "This used to be one of my favorite places! Growing up in Bombay, I loved how they brought the authentic flavors into their dishes. However I was disappointed with with takeout order last night. I ordered the vada pav and the bhel, and both of them didn't meet the mark. The Vada was chewy and crusty and did have the softness it usually does, it was also a little burned. The bhel puri didn't have any of its regular vegetables, potatoes etc. it was just puri bhel mix and chutneys. To give them the benefit I thought, it was probably a function of the takeout, but it wasn't. It was truly disappointing to see one of my favorite places not meet the standards. I am writing this to draw awareness to my experience so something can be done.", "stars": 3.0}, {"review": "Chai Pani is an Indian restaurant that opened March 2013 in downtown Decatur. This is the restaurant's second location. The original opened in 2009 in Asheville, NC. Both locations are popular. Chai Pani serves chaat (Indian street food), uttapam (crepes), Indian-inspired salads, sandwiches, and burgers, and thalis (traditional meals). The business has a fresh, modern take on Indian cuisine yet is still authentic.Chai Pani shares a building with next door neighbor Farm Burger. Free parking is located on-site, though it may be limited at peak times.Chai Pani is not your typical Indian restaurant. There are Americanized and contemporary twists to both the restaurant design/atmosphere as well as the menu. This place has an open loft/warehouse look. I believe the building originally served as a garage or gas station long ago. The interior is spacious with two dining rooms and a 10-seat bar in the back. During the daytime, natural light fills the space. There's a small covered patio in front. The ambiance is laid back and casual. At lunchtime, you order at the counter and grab water/utensils yourself. At dinnertime, there's sit-down service.Interesting and unique foods include Kale Pakoras (fritters), Matchstick Okra Fries, the Maharaja Lamb Burger, and the Bengali Fish Fry Sandwich, the latter two cooked/prepared with various Indian spices and chutneys. Chai Pani's ingredients are higher quality than most Indian restaurants. They use local dairy products and all-natural, free-range chicken. Spices are ground in-house and chutneys and sauces are made from scratch. Expect to spend about $6-9 each for most chaat and closer to $10 each for salads, sandwiches/burgers, uttapam, and thalis.I've tried several items. Here's a rundown:Chaat (street food):* Kale Pakoras - kale fritters made with curried chickpea batter, served with green chutney and sweet yogurt* Matchstick Okra Fries - julienned okra, battered and fried, tossed with lime, salt, and other seasonings* Panipuri - street snack made with hollowed-out bread (puri) and flavored sauce (pani) (more details below)Sandwiches:* \"Sloppy Jai\" (Kheema Pav) - spiced lamb hash simmered with tomatoes, ginger, and spices, served with onions, cilantro, green chutney, and sweet yogurt* Vada Pav - spicy potato dumplings fried in curried chickpea batter topped with green and tamarind chutneys* Mixed Vegetable Uttapam - crepe made from rice and lentil batter with carrots, peas, onion, cilantro, ginger, and chilies, served with sambar and coconut chutneys* Non-Vegetarian Thali - basmati rice, dal (lentils), kachumber (side salad), roti (soft bread), raita (yogurt), papadum (crispy flatbread), Malabar chicken (more details below)* Mango Lassi - sweet yogurt drink made with mango pulp and cardamomThere's a lot of good food here. My favorites are the Kale Pakoras, Panipuri, Sloppy Jai, and Mixed Veggie Uttapam. Both the Kale Pakoras and Okra Fries are deep-fried and crispy. The batter on both dishes is surprisingly thin and pleasantly light. The sweet yogurt on the Kale Pakoras is a nice touch. Fried kale can often be too greasy or over-battered, but I think Chai Pani has done a nice job with their pakoras. The Okra Fries are almost like chips. The julienning process creates a neat-looking, cross-section-like presentation.Panipuri is a special. I want to say it's the Indian counterpart to Chinese xiaolongbao (soup dumplings), but maybe not quite. Panipuris are hollowed-out fried breads (puri) filled with a potato, chickpea, and spice mixture, mung beans, tamarind chutney, and a cilantro-flavored water/sauce (pani). Each panipuri is bite-size and delicious. Here's a video I recorded of panipuri being prepared at the bar: instagram.com/p/nrC0LjwB….The Sloppy Jai is mighty tasty and just as satisfying and comforting as some of the best sloppy joes I've had. While the lamb hash has a surprisingly similar consistency to ground beef, it expectedly has a different (good) taste and aroma. While not bad, I'm not as big of a fan of the Vada Pav, though potato sandwiches aren't my thing. Just too much bread and dense starch for me. Both the Sloppy Jai and Vada Pav come on soft, toasted buns.The Mixed Veggie Uttapam is savory. I would characterize its texture more to that of fried hashbrowns than I would a delicate crepe or pancake. Small portion size, but quite fulfilling.The thali is okay and on par, at best, with other Atlanta area Indian restaurants. There aren't many selections to choose from when it comes to Chai Pani's thali, but their focus is street food. The Malabar chicken curry is made with chicken breast, tomatoes, chilies, onion, tumeric, coriander, and coconut milk. Against popular opinion, I think the chicken is too dry and the sauce is mostly unmemorable. My advice: Stick with the snacks, sandwiches, and crepes.Order a mango lassi. It's excellent. Addictive and not too sweet nor thick.Service is great.", "stars": 4.0}, {"review": "Friends raved about this restaurant and it was clear to see why. The staff was friendly and they have a great selection of \"Indian street food., including several options that you can't find on most Indian menus (salt lassi for instance).  The inside of the restaurant was beautiful with murals and Indian-inspired decor.You really could not go wrong with anything that you order. We particularly enjoyed the sloppy jai, chili chicken, samosas, and chaat. While this is Indian street food, don't expect to pay those prices. It was a bit pricey, for the portions and what you ultimately got, but the food was well worth it.", "stars": 4.0}]}